export const Lngs = {
    AgreeNotice: "還未同意協議！",
    ShopTip1: "購買成功！當前破魔券數量：",
    ShopTip2: "兌換成功！禮物已放入您的背包成功！",
    ShopTip3: "破魔券不足！",
    ShopTip4: "金币不足！",
    ShopTip5: "兌換成功！",
    BoxNan: "寶箱數量不足！",
    GetBoxDes1: "在黃白銀箱中開啟",
    GetBoxDes2: "在黃金寶箱中開啟",
    GetBoxDes3: "在鑽石寶箱中開啟",
    EndOpen1: "當前白银寶箱數量",
    EndOpen2: "當前鑽石寶箱數量",
    EndOpen3: "當前黃金寶箱數量",
    One: "個",
    GetBox1: "您獲得白銀寶箱",
    GetBox2: "您獲得黃金寶箱",
    GetBox3: "您獲得鑽石寶箱",
    RankDes1: "結束時間：",
    RankDes2: "暫無排行",
    Box_BY: "白銀",
    Box_HJ: "黃金",
    Box_ZS: "鑽石",
    BossDied: "惡魔Boss已被消滅",
    TextPMQ: "破魔券",
    RankTimeStart: "開始時間",
    RankTimeEnd: "結束時間",
    RankHurt: "傷害值：",
    MsgPop1: "恭喜",
    MsgPop2: "獲得",
    MsgPop3: "破魔券",
    GetPlayerInfoErr: "獲取玩家資訊失敗!",
    RewardDes1: "暫無記錄",
    RewardPriceDes: `每日攻擊傷害排行榜獎勵：`,

    //玩法公告
    Notice: `本功能玩法不向未成年人開放，未成年人用戶請勿參與。
1. 本平台玩法均為提升用戶體驗設計，任何用戶和主播均不得利用平台玩法實施任何違法犯罪的行為或用於任何違法犯罪的用戶;
2. 本平台玩法中獲得的禮物和獎勵僅限於在平台內消費，禁止房主、主持、用戶及其他第三方主體進行任何形式的背包禮物交易;
3. 健康遊戲，理性消費，如存在上述行為，平台將嚴格按照平台規則採取相關管理措施.`,
    Notice_Txt1: "我已閱讀並同意",
    Notice_Txt2: "《玩法須知和公約》",
    Notice_Txt3: "今日不再彈出",
    //玩法须知和公约
    Agree: `1、透過機率獲得的隨機禮物僅限於在平台內消費，不得以任何形式兌換成法定貨幣、現金或其他任何具有交換價值的物品或服務，禁止主播、主播所在公會、用戶及其他第三方主體進行任何形式的禮物交易，否則平台將嚴格按照平台規則對相關用戶採取相關管理措施，用戶應自行對此承擔法律責任及相關損失。請用戶謹防上當受騙。
2、本功能玩法不向未成年人開放，未成年人用戶請勿參與，平台將通過大數據和實名認證等方式實時跟蹤，確保此功能不會被未成年人使用。直播間內主播、主播所在公會以及房間其他用戶禁止引導未成年人用戶參與本功能玩法，引導未成年人參與本功能玩法將受到平台嚴厲打擊和處罰。
3、機率禮物是提升房間內互動體驗的功能，僅供娛樂交流使用。直播間內主播、主播所在公會以及其他任何主體均不得以任何非法目的與方式（包括但不限於賭博、詐騙等）對其進行使用。
4、禁止使用機率禮物玩法實施任何影響互動公平性的行為，或利用產品BUG等不正當手法參與互動，一旦發生上述情況，平台有權取消發放對應獎勵，追回獎勵，對情節嚴重的，平台保留一切追充法律責任的權利。
5、用戶不得以任何不正當手段或舞弊的方式參與本功能玩法，一經發現，平台有權取消用戶的參與資格，並有權收回用戶獲得的禮物及權益，同時保留追究其相關法律責任的權利。不正當手段及舞弊行為包括但不限於：下載非官方客戶端、使用插件、外掛等非法工具掃碼、下載、安裝、註冊、登錄、使用；篡改設備數據；惡意牟利等擾亂平台秩序；使用插件、外掛系統或第三方工具對本平台及本活動進行干擾、破壞、修改或施加其他影響及平台認為的其他不正當手段。
6、因用戶操作不當或用戶所在區域網絡故障、支付平台網絡故障、電信運營商故障、第三方其他平台限制等非平台所能控制的原因導致的用戶無法參與活動、或參與失敗，平台無需為此承擔任何法律責任。
7、平台可能在房間、功能頁展示用戶賬號信息及所獲得的隨機禮物等信息，您授權並同意平台為此使用並展示您的公開帳號信息（如頭像、暱稱等）及所獲得隨機禮物等信息。
8、平台依法運營此功能玩法，如因不可抗力、情勢變更，相關政策變動、政府機關指令要求等原因導致本功能玩法調整、暫停舉辦或無法進行的，平台有權隨時決定修改、暫停、取消或終止本功能玩法，並無需為此承擔任何法律責任。`,
};
